lpodkalicki/blog/avr/asm/include/ATxmega256A3Bdef.inc
.equ USARTD0_DATA = 2464		// Data Register
.equ USARTD0_STATUS = 2465		// Status Register
.equ USARTD0_CTRLA = 2467		// Control Register A
.equ USARTD0_CTRLB = 2468		// Control Register B
.equ USARTD0_CTRLC = 2469		// Control Register C
.equ USARTD0_BAUDCTRLA = 2470		// Baud Rate Control Register A
.equ USARTD0_BAUDCTRLB = 2471		// Baud Rate Control Register B

;***************************************************************************
;** USARTD1 - Universal Asynchronous Receiver-Transmitter D1
;***************************************************************************
	
.equ USARTD1_DATA = 2480		// Data Register
.equ USARTD1_STATUS = 2481		// Status Register
.equ USARTD1_CTRLA = 2483		// Control Register A
.equ USARTD1_CTRLB = 2484		// Control Register B
.equ USARTD1_CTRLC = 2485		// Control Register C
.equ USARTD1_BAUDCTRLA = 2486		// Baud Rate Control Register A
.equ USARTD1_BAUDCTRLB = 2487		// Baud Rate Control Register B

;***************************************************************************
;** SPID - Serial Peripheral Interface D
;***************************************************************************
	
.equ SPID_CTRL = 2496		// Control Register
.equ SPID_INTCTRL = 2497		// Interrupt Control Register
.equ SPID_STATUS = 2498		// Status Register
.equ SPID_DATA = 2499		// Data Register

;***************************************************************************
;** TCE0 - Timer/Counter E0
;***************************************************************************
	
.equ TCE0_CTRLA = 2560		// Control Register A
.equ TCE0_CTRLB = 2561		// Control Register B
.equ TCE0_CTRLC = 2562		// Control register C
.equ TCE0_CTRLD = 2563		// Control Register D
.equ TCE0_CTRLE = 2564		// Control Register E
.equ TCE0_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE0_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE0_CTRLFCLR = 2568		// Control Register F Clear
.equ TCE0_CTRLFSET = 2569		// Control Register F Set
.equ TCE0_CTRLGCLR = 2570		// Control Register G Clear
.equ TCE0_CTRLGSET = 2571		// Control Register G Set
.equ TCE0_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE0_TEMP = 2575		// Temporary Register For 16-bit Access
.equ TCE0_CNT = 2592		// Count
.equ TCE0_PER = 2598		// Period
.equ TCE0_CCA = 2600		// Compare or Capture A
.equ TCE0_CCB = 2602		// Compare or Capture B
.equ TCE0_CCC = 2604		// Compare or Capture C
.equ TCE0_CCD = 2606		// Compare or Capture D
.equ TCE0_PERBUF = 2614		// Period Buffer
.equ TCE0_CCABUF = 2616		// Compare Or Capture A Buffer
.equ TCE0_CCBBUF = 2618		// Compare Or Capture B Buffer
.equ TCE0_CCCBUF = 2620		// Compare Or Capture C Buffer
.equ TCE0_CCDBUF = 2622		// Compare Or Capture D Buffer

;***************************************************************************
;** TCE1 - Timer/Counter E1
;***************************************************************************
	
.equ TCE1_CTRLA = 2624		// Control  Register A
.equ TCE1_CTRLB = 2625		// Control Register B
.equ TCE1_CTRLC = 2626		// Control register C
.equ TCE1_CTRLD = 2627		// Control Register D
.equ TCE1_CTRLE = 2628		// Control Register E
.equ TCE1_INTCTRLA = 2630		// Interrupt Control Register A
.equ TCE1_INTCTRLB = 2631		// Interrupt Control Register B
.equ TCE1_CTRLFCLR = 2632		// Control Register F Clear
.equ TCE1_CTRLFSET = 2633		// Control Register F Set
.equ TCE1_CTRLGCLR = 2634		// Control Register G Clear
.equ TCE1_CTRLGSET = 2635		// Control Register G Set
.equ TCE1_INTFLAGS = 2636		// Interrupt Flag Register
.equ TCE1_TEMP = 2639		// Temporary Register For 16-bit Access
.equ TCE1_CNT = 2656		// Count
.equ TCE1_PER = 2662		// Period
.equ TCE1_CCA = 2664		// Compare or Capture A
.equ TCE1_CCB = 2666		// Compare or Capture B
.equ TCE1_PERBUF = 2678		// Period Buffer
.equ TCE1_CCABUF = 2680		// Compare Or Capture A Buffer
.equ TCE1_CCBBUF = 2682		// Compare Or Capture B Buffer

;***************************************************************************
;** AWEXE - Advanced Waveform Extension E
;***************************************************************************
	
.equ AWEXE_CTRL = 2688		// Control Register
.equ AWEXE_FDEMASK = 2690		// Fault Detection Event Mask
.equ AWEXE_FDCTRL = 2691		// Fault Detection Control Register
.equ AWEXE_STATUS = 2692		// Status Register
.equ AWEXE_DTBOTH = 2694		// Dead Time Both Sides
.equ AWEXE_DTBOTHBUF = 2695		// Dead Time Both Sides Buffer
.equ AWEXE_DTLS = 2696		// Dead Time Low Side
.equ AWEXE_DTHS = 2697		// Dead Time High Side
.equ AWEXE_DTLSBUF = 2698		// Dead Time Low Side Buffer
.equ AWEXE_DTHSBUF = 2699		// Dead Time High Side Buffer
.equ AWEXE_OUTOVEN = 2700		// Output Override Enable

;***************************************************************************
;** HIRESE - High-Resolution Extension E
;***************************************************************************
	
.equ HIRESE_CTRLA = 2704		// Control Register

;***************************************************************************
;** USARTE0 - Universal Asynchronous Receiver-Transmitter E0
;***************************************************************************
	
.equ USARTE0_DATA = 2720		// Data Register
.equ USARTE0_STATUS = 2721		// Status Register
.equ USARTE0_CTRLA = 2723		// Control Register A
.equ USARTE0_CTRLB = 2724		// Control Register B
.equ USARTE0_CTRLC = 2725		// Control Register C
.equ USARTE0_BAUDCTRLA = 2726		// Baud Rate Control Register A
.equ USARTE0_BAUDCTRLB = 2727		// Baud Rate Control Register B

;***************************************************************************
;** TCF0 - Timer/Counter F0
;***************************************************************************
	
.equ TCF0_CTRLA = 2816		// Control Register A
.equ TCF0_CTRLB = 2817		// Control Register B
.equ TCF0_CTRLC = 2818		// Control register C
.equ TCF0_CTRLD = 2819		// Control Register D
.equ TCF0_CTRLE = 2820		// Control Register E
.equ TCF0_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF0_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF0_CTRLFCLR = 2824		// Control Register F Clear
.equ TCF0_CTRLFSET = 2825		// Control Register F Set
.equ TCF0_CTRLGCLR = 2826		// Control Register G Clear
.equ TCF0_CTRLGSET = 2827		// Control Register G Set
.equ TCF0_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF0_TEMP = 2831		// Temporary Register For 16-bit Access
.equ TCF0_CNT = 2848		// Count
.equ TCF0_PER = 2854		// Period
.equ TCF0_CCA = 2856		// Compare or Capture A
.equ TCF0_CCB = 2858		// Compare or Capture B
.equ TCF0_CCC = 2860		// Compare or Capture C
.equ TCF0_CCD = 2862		// Compare or Capture D
.equ TCF0_PERBUF = 2870		// Period Buffer
.equ TCF0_CCABUF = 2872		// Compare Or Capture A Buffer
.equ TCF0_CCBBUF = 2874		// Compare Or Capture B Buffer
.equ TCF0_CCCBUF = 2876		// Compare Or Capture C Buffer
.equ TCF0_CCDBUF = 2878		// Compare Or Capture D Buffer

;***************************************************************************
;** HIRESF - High-Resolution Extension F
;***************************************************************************
	
.equ HIRESF_CTRLA = 2960		// Control Register

;***************************************************************************
;** USARTF0 - Universal Asynchronous Receiver-Transmitter F0
;***************************************************************************
	
.equ USARTF0_DATA = 2976		// Data Register
.equ USARTF0_STATUS = 2977		// Status Register
.equ USARTF0_CTRLA = 2979		// Control Register A
.equ USARTF0_CTRLB = 2980		// Control Register B
.equ USARTF0_CTRLC = 2981		// Control Register C
.equ USARTF0_BAUDCTRLA = 2982		// Baud Rate Control Register A
.equ USARTF0_BAUDCTRLB = 2983		// Baud Rate Control Register B

;***************************************************************************
;** USARTF1 - Universal Asynchronous Receiver-Transmitter F1
;***************************************************************************
	
.equ USARTF1_DATA = 2992		// Data Register
.equ USARTF1_STATUS = 2993		// Status Register
.equ USARTF1_CTRLA = 2995		// Control Register A
.equ USARTF1_CTRLB = 2996		// Control Register B
.equ USARTF1_CTRLC = 2997		// Control Register C
.equ USARTF1_BAUDCTRLA = 2998		// Baud Rate Control Register A
.equ USARTF1_BAUDCTRLB = 2999		// Baud Rate Control Register B

;***************************************************************************
;** SPIF - Serial Peripheral Interface F
;***************************************************************************
	
.equ SPIF_CTRL = 3008		// Control Register
.equ SPIF_INTCTRL = 3009		// Interrupt Control Register
.equ SPIF_STATUS = 3010		// Status Register
.equ SPIF_DATA = 3011		// Data Register

;***************************************************************************
;** IRCOM - IR Communication Module
;***************************************************************************
	
.equ IRCOM_CTRL = 2296		// Control Register
.equ IRCOM_TXPLCTRL = 2297		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL = 2298		// IrDA Receiver Pulse Length Control Register

;***************************************************************************
;** AES - AES Crypto Module
;***************************************************************************
	
.equ AES_CTRL = 192		// AES Control Register
.equ AES_STATUS = 193		// AES Status Register
.equ AES_STATE = 194		// AES State Register
.equ AES_KEY = 195		// AES Key Register
.equ AES_INTCTRL = 196		// AES Interrupt Control Register

;***************************************************************************
;** VBAT - VBAT Battery Backup Module
;***************************************************************************
	
