lpodkalicki/blog/avr/asm/include/ATxmega256A3Bdef.inc
; RTC32_SYNCCTRL masks
.equ RTC32_SYNCCNT_bm = 0x10 ; Synchronization Busy Flag bit mask
.equ RTC32_SYNCCNT_bp = 4 ; Synchronization Busy Flag bit position
.equ RTC32_SYNCBUSY_bm = 0x01 ; Synchronization Busy Flag bit mask
.equ RTC32_SYNCBUSY_bp = 0 ; Synchronization Busy Flag bit position

; RTC32_INTCTRL masks
.equ RTC32_COMPINTLVL_gm = 0x0C ; Compare Match Interrupt Level group mask
.equ RTC32_COMPINTLVL_gp = 2 ; Compare Match Interrupt Level group position
.equ RTC32_COMPINTLVL0_bm = (1<<2) ; Compare Match Interrupt Level bit 0 mask
.equ RTC32_COMPINTLVL0_bp = 2 ; Compare Match Interrupt Level bit 0 position
.equ RTC32_COMPINTLVL1_bm = (1<<3) ; Compare Match Interrupt Level bit 1 mask
.equ RTC32_COMPINTLVL1_bp = 3 ; Compare Match Interrupt Level bit 1 position
.equ RTC32_OVFINTLVL_gm = 0x03 ; Overflow Interrupt Level group mask
.equ RTC32_OVFINTLVL_gp = 0 ; Overflow Interrupt Level group position
.equ RTC32_OVFINTLVL0_bm = (1<<0) ; Overflow Interrupt Level bit 0 mask
.equ RTC32_OVFINTLVL0_bp = 0 ; Overflow Interrupt Level bit 0 position
.equ RTC32_OVFINTLVL1_bm = (1<<1) ; Overflow Interrupt Level bit 1 mask
.equ RTC32_OVFINTLVL1_bp = 1 ; Overflow Interrupt Level bit 1 position

; RTC32_INTFLAGS masks
.equ RTC32_COMPIF_bm = 0x02 ; Compare Match Interrupt Flag bit mask
.equ RTC32_COMPIF_bp = 1 ; Compare Match Interrupt Flag bit position
.equ RTC32_OVFIF_bm = 0x01 ; Overflow Interrupt Flag bit mask
.equ RTC32_OVFIF_bp = 0 ; Overflow Interrupt Flag bit position
 
; Compare Interrupt level
.equ RTC32_COMPINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ RTC32_COMPINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ RTC32_COMPINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ RTC32_COMPINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt level
.equ RTC32_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ RTC32_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ RTC32_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ RTC32_OVFINTLVL_HI_gc = (0x03<<0) ; High Level


;***************************************************************************
;** EBI - External Bus Interface
;***************************************************************************/

; EBI_CS_CTRLA masks
.equ EBI_CS_ASPACE_gm = 0x7C ; Address Space group mask
.equ EBI_CS_ASPACE_gp = 2 ; Address Space group position
.equ EBI_CS_ASPACE0_bm = (1<<2) ; Address Space bit 0 mask
.equ EBI_CS_ASPACE0_bp = 2 ; Address Space bit 0 position
.equ EBI_CS_ASPACE1_bm = (1<<3) ; Address Space bit 1 mask
.equ EBI_CS_ASPACE1_bp = 3 ; Address Space bit 1 position
.equ EBI_CS_ASPACE2_bm = (1<<4) ; Address Space bit 2 mask
.equ EBI_CS_ASPACE2_bp = 4 ; Address Space bit 2 position
.equ EBI_CS_ASPACE3_bm = (1<<5) ; Address Space bit 3 mask
.equ EBI_CS_ASPACE3_bp = 5 ; Address Space bit 3 position
.equ EBI_CS_ASPACE4_bm = (1<<6) ; Address Space bit 4 mask
.equ EBI_CS_ASPACE4_bp = 6 ; Address Space bit 4 position
.equ EBI_CS_MODE_gm = 0x03 ; Memory Mode group mask
.equ EBI_CS_MODE_gp = 0 ; Memory Mode group position
.equ EBI_CS_MODE0_bm = (1<<0) ; Memory Mode bit 0 mask
.equ EBI_CS_MODE0_bp = 0 ; Memory Mode bit 0 position
.equ EBI_CS_MODE1_bm = (1<<1) ; Memory Mode bit 1 mask
.equ EBI_CS_MODE1_bp = 1 ; Memory Mode bit 1 position

; EBI_CS_CTRLB masks
.equ EBI_CS_SRWS_gm = 0x07 ; SRAM Wait State Cycles group mask
.equ EBI_CS_SRWS_gp = 0 ; SRAM Wait State Cycles group position
.equ EBI_CS_SRWS0_bm = (1<<0) ; SRAM Wait State Cycles bit 0 mask
.equ EBI_CS_SRWS0_bp = 0 ; SRAM Wait State Cycles bit 0 position
.equ EBI_CS_SRWS1_bm = (1<<1) ; SRAM Wait State Cycles bit 1 mask
.equ EBI_CS_SRWS1_bp = 1 ; SRAM Wait State Cycles bit 1 position
.equ EBI_CS_SRWS2_bm = (1<<2) ; SRAM Wait State Cycles bit 2 mask
.equ EBI_CS_SRWS2_bp = 2 ; SRAM Wait State Cycles bit 2 position
.equ EBI_CS_SDINITDONE_bm = 0x80 ; SDRAM Initialization Done bit mask
.equ EBI_CS_SDINITDONE_bp = 7 ; SDRAM Initialization Done bit position
.equ EBI_CS_SDSREN_bm = 0x04 ; SDRAM Self-refresh Enable bit mask
.equ EBI_CS_SDSREN_bp = 2 ; SDRAM Self-refresh Enable bit position
.equ EBI_CS_SDMODE_gm = 0x03 ; SDRAM Mode group mask
.equ EBI_CS_SDMODE_gp = 0 ; SDRAM Mode group position
.equ EBI_CS_SDMODE0_bm = (1<<0) ; SDRAM Mode bit 0 mask
.equ EBI_CS_SDMODE0_bp = 0 ; SDRAM Mode bit 0 position
.equ EBI_CS_SDMODE1_bm = (1<<1) ; SDRAM Mode bit 1 mask
.equ EBI_CS_SDMODE1_bp = 1 ; SDRAM Mode bit 1 position

; EBI_CTRL masks
.equ EBI_SDDATAW_gm = 0xC0 ; SDRAM Data Width Setting group mask
.equ EBI_SDDATAW_gp = 6 ; SDRAM Data Width Setting group position
.equ EBI_SDDATAW0_bm = (1<<6) ; SDRAM Data Width Setting bit 0 mask
.equ EBI_SDDATAW0_bp = 6 ; SDRAM Data Width Setting bit 0 position
.equ EBI_SDDATAW1_bm = (1<<7) ; SDRAM Data Width Setting bit 1 mask
.equ EBI_SDDATAW1_bp = 7 ; SDRAM Data Width Setting bit 1 position
.equ EBI_LPCMODE_gm = 0x30 ; SRAM LPC Mode group mask
.equ EBI_LPCMODE_gp = 4 ; SRAM LPC Mode group position
.equ EBI_LPCMODE0_bm = (1<<4) ; SRAM LPC Mode bit 0 mask
.equ EBI_LPCMODE0_bp = 4 ; SRAM LPC Mode bit 0 position
.equ EBI_LPCMODE1_bm = (1<<5) ; SRAM LPC Mode bit 1 mask
.equ EBI_LPCMODE1_bp = 5 ; SRAM LPC Mode bit 1 position
.equ EBI_SRMODE_gm = 0x0C ; SRAM Mode group mask
.equ EBI_SRMODE_gp = 2 ; SRAM Mode group position
.equ EBI_SRMODE0_bm = (1<<2) ; SRAM Mode bit 0 mask
.equ EBI_SRMODE0_bp = 2 ; SRAM Mode bit 0 position
.equ EBI_SRMODE1_bm = (1<<3) ; SRAM Mode bit 1 mask
.equ EBI_SRMODE1_bp = 3 ; SRAM Mode bit 1 position
.equ EBI_IFMODE_gm = 0x03 ; Interface Mode group mask
.equ EBI_IFMODE_gp = 0 ; Interface Mode group position
.equ EBI_IFMODE0_bm = (1<<0) ; Interface Mode bit 0 mask
.equ EBI_IFMODE0_bp = 0 ; Interface Mode bit 0 position
.equ EBI_IFMODE1_bm = (1<<1) ; Interface Mode bit 1 mask
.equ EBI_IFMODE1_bp = 1 ; Interface Mode bit 1 position

; EBI_SDRAMCTRLA masks
.equ EBI_SDCAS_bm = 0x08 ; SDRAM CAS Latency Setting bit mask
.equ EBI_SDCAS_bp = 3 ; SDRAM CAS Latency Setting bit position
.equ EBI_SDROW_bm = 0x04 ; SDRAM ROW Bits Setting bit mask
.equ EBI_SDROW_bp = 2 ; SDRAM ROW Bits Setting bit position
.equ EBI_SDCOL_gm = 0x03 ; SDRAM Column Bits Setting group mask
.equ EBI_SDCOL_gp = 0 ; SDRAM Column Bits Setting group position
.equ EBI_SDCOL0_bm = (1<<0) ; SDRAM Column Bits Setting bit 0 mask
.equ EBI_SDCOL0_bp = 0 ; SDRAM Column Bits Setting bit 0 position
.equ EBI_SDCOL1_bm = (1<<1) ; SDRAM Column Bits Setting bit 1 mask
.equ EBI_SDCOL1_bp = 1 ; SDRAM Column Bits Setting bit 1 position

; EBI_SDRAMCTRLB masks
.equ EBI_MRDLY_gm = 0xC0 ; SDRAM Mode Register Delay group mask
.equ EBI_MRDLY_gp = 6 ; SDRAM Mode Register Delay group position
.equ EBI_MRDLY0_bm = (1<<6) ; SDRAM Mode Register Delay bit 0 mask
.equ EBI_MRDLY0_bp = 6 ; SDRAM Mode Register Delay bit 0 position
.equ EBI_MRDLY1_bm = (1<<7) ; SDRAM Mode Register Delay bit 1 mask
.equ EBI_MRDLY1_bp = 7 ; SDRAM Mode Register Delay bit 1 position
.equ EBI_ROWCYCDLY_gm = 0x38 ; SDRAM Row Cycle Delay group mask
.equ EBI_ROWCYCDLY_gp = 3 ; SDRAM Row Cycle Delay group position
.equ EBI_ROWCYCDLY0_bm = (1<<3) ; SDRAM Row Cycle Delay bit 0 mask
.equ EBI_ROWCYCDLY0_bp = 3 ; SDRAM Row Cycle Delay bit 0 position
.equ EBI_ROWCYCDLY1_bm = (1<<4) ; SDRAM Row Cycle Delay bit 1 mask
.equ EBI_ROWCYCDLY1_bp = 4 ; SDRAM Row Cycle Delay bit 1 position
.equ EBI_ROWCYCDLY2_bm = (1<<5) ; SDRAM Row Cycle Delay bit 2 mask
.equ EBI_ROWCYCDLY2_bp = 5 ; SDRAM Row Cycle Delay bit 2 position
.equ EBI_RPDLY_gm = 0x07 ; SDRAM Row-to-Precharge Delay group mask
.equ EBI_RPDLY_gp = 0 ; SDRAM Row-to-Precharge Delay group position
.equ EBI_RPDLY0_bm = (1<<0) ; SDRAM Row-to-Precharge Delay bit 0 mask
.equ EBI_RPDLY0_bp = 0 ; SDRAM Row-to-Precharge Delay bit 0 position
.equ EBI_RPDLY1_bm = (1<<1) ; SDRAM Row-to-Precharge Delay bit 1 mask
.equ EBI_RPDLY1_bp = 1 ; SDRAM Row-to-Precharge Delay bit 1 position
.equ EBI_RPDLY2_bm = (1<<2) ; SDRAM Row-to-Precharge Delay bit 2 mask
.equ EBI_RPDLY2_bp = 2 ; SDRAM Row-to-Precharge Delay bit 2 position

; EBI_SDRAMCTRLC masks
.equ EBI_WRDLY_gm = 0xC0 ; SDRAM Write Recovery Delay group mask
.equ EBI_WRDLY_gp = 6 ; SDRAM Write Recovery Delay group position
.equ EBI_WRDLY0_bm = (1<<6) ; SDRAM Write Recovery Delay bit 0 mask
.equ EBI_WRDLY0_bp = 6 ; SDRAM Write Recovery Delay bit 0 position
.equ EBI_WRDLY1_bm = (1<<7) ; SDRAM Write Recovery Delay bit 1 mask
.equ EBI_WRDLY1_bp = 7 ; SDRAM Write Recovery Delay bit 1 position
.equ EBI_ESRDLY_gm = 0x38 ; SDRAM Exit-Self-refresh-to-Active Delay group mask
.equ EBI_ESRDLY_gp = 3 ; SDRAM Exit-Self-refresh-to-Active Delay group position
.equ EBI_ESRDLY0_bm = (1<<3) ; SDRAM Exit-Self-refresh-to-Active Delay bit 0 mask
.equ EBI_ESRDLY0_bp = 3 ; SDRAM Exit-Self-refresh-to-Active Delay bit 0 position
.equ EBI_ESRDLY1_bm = (1<<4) ; SDRAM Exit-Self-refresh-to-Active Delay bit 1 mask
.equ EBI_ESRDLY1_bp = 4 ; SDRAM Exit-Self-refresh-to-Active Delay bit 1 position
.equ EBI_ESRDLY2_bm = (1<<5) ; SDRAM Exit-Self-refresh-to-Active Delay bit 2 mask
.equ EBI_ESRDLY2_bp = 5 ; SDRAM Exit-Self-refresh-to-Active Delay bit 2 position
.equ EBI_ROWCOLDLY_gm = 0x07 ; SDRAM Row-to-Column Delay group mask
.equ EBI_ROWCOLDLY_gp = 0 ; SDRAM Row-to-Column Delay group position
.equ EBI_ROWCOLDLY0_bm = (1<<0) ; SDRAM Row-to-Column Delay bit 0 mask
.equ EBI_ROWCOLDLY0_bp = 0 ; SDRAM Row-to-Column Delay bit 0 position
.equ EBI_ROWCOLDLY1_bm = (1<<1) ; SDRAM Row-to-Column Delay bit 1 mask
.equ EBI_ROWCOLDLY1_bp = 1 ; SDRAM Row-to-Column Delay bit 1 position
.equ EBI_ROWCOLDLY2_bm = (1<<2) ; SDRAM Row-to-Column Delay bit 2 mask
.equ EBI_ROWCOLDLY2_bp = 2 ; SDRAM Row-to-Column Delay bit 2 position
 
; Chip Select adress space
.equ EBI_CS_ASPACE_256B_gc = (0x00<<2) ; 256 bytes
.equ EBI_CS_ASPACE_512B_gc = (0x01<<2) ; 512 bytes
.equ EBI_CS_ASPACE_1KB_gc = (0x02<<2) ; 1K bytes
.equ EBI_CS_ASPACE_2KB_gc = (0x03<<2) ; 2K bytes
.equ EBI_CS_ASPACE_4KB_gc = (0x04<<2) ; 4K bytes
.equ EBI_CS_ASPACE_8KB_gc = (0x05<<2) ; 8K bytes
.equ EBI_CS_ASPACE_16KB_gc = (0x06<<2) ; 16K bytes
.equ EBI_CS_ASPACE_32KB_gc = (0x07<<2) ; 32K bytes
.equ EBI_CS_ASPACE_64KB_gc = (0x08<<2) ; 64K bytes
.equ EBI_CS_ASPACE_128KB_gc = (0x09<<2) ; 128K bytes
.equ EBI_CS_ASPACE_256KB_gc = (0x0A<<2) ; 256K bytes
.equ EBI_CS_ASPACE_512KB_gc = (0x0B<<2) ; 512K bytes
.equ EBI_CS_ASPACE_1MB_gc = (0x0C<<2) ; 1M bytes
.equ EBI_CS_ASPACE_2MB_gc = (0x0D<<2) ; 2M bytes
.equ EBI_CS_ASPACE_4MB_gc = (0x0E<<2) ; 4M bytes
.equ EBI_CS_ASPACE_8MB_gc = (0x0F<<2) ; 8M bytes
.equ EBI_CS_ASPACE_16M_gc = (0x10<<2) ; 16M bytes

; SRAM Wait State Selection
.equ EBI_CS_SRWS_0CLK_gc = (0x00<<0) ; 0 cycles
.equ EBI_CS_SRWS_1CLK_gc = (0x01<<0) ; 1 cycle
.equ EBI_CS_SRWS_2CLK_gc = (0x02<<0) ; 2 cycles
.equ EBI_CS_SRWS_3CLK_gc = (0x03<<0) ; 3 cycles
.equ EBI_CS_SRWS_4CLK_gc = (0x04<<0) ; 4 cycles
.equ EBI_CS_SRWS_5CLK_gc = (0x05<<0) ; 5 cycles
.equ EBI_CS_SRWS_6CLK_gc = (0x06<<0) ; 6 cycles
.equ EBI_CS_SRWS_7CLK_gc = (0x07<<0) ; 7 cycles

