lpodkalicki/blog/avr/asm/include/ATxmega256A3Bdef.inc
; AES_CTRL masks
.equ AES_START_bm = 0x80 ; Start/Run bit mask
.equ AES_START_bp = 7 ; Start/Run bit position
.equ AES_AUTO_bm = 0x40 ; Auto Start Trigger bit mask
.equ AES_AUTO_bp = 6 ; Auto Start Trigger bit position
.equ AES_RESET_bm = 0x20 ; AES Software Reset bit mask
.equ AES_RESET_bp = 5 ; AES Software Reset bit position
.equ AES_DECRYPT_bm = 0x10 ; Decryption / Direction bit mask
.equ AES_DECRYPT_bp = 4 ; Decryption / Direction bit position
.equ AES_XOR_bm = 0x04 ; State XOR Load Enable bit mask
.equ AES_XOR_bp = 2 ; State XOR Load Enable bit position

; AES_STATUS masks
.equ AES_ERROR_bm = 0x80 ; AES Error bit mask
.equ AES_ERROR_bp = 7 ; AES Error bit position
.equ AES_SRIF_bm = 0x01 ; State Ready Interrupt Flag bit mask
.equ AES_SRIF_bp = 0 ; State Ready Interrupt Flag bit position

; AES_INTCTRL masks
.equ AES_INTLVL_gm = 0x03 ; Interrupt level group mask
.equ AES_INTLVL_gp = 0 ; Interrupt level group position
.equ AES_INTLVL0_bm = (1<<0) ; Interrupt level bit 0 mask
.equ AES_INTLVL0_bp = 0 ; Interrupt level bit 0 position
.equ AES_INTLVL1_bm = (1<<1) ; Interrupt level bit 1 mask
.equ AES_INTLVL1_bp = 1 ; Interrupt level bit 1 position
 
; Interrupt level
.equ AES_INTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ AES_INTLVL_LO_gc = (0x01<<0) ; Low Level
.equ AES_INTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ AES_INTLVL_HI_gc = (0x03<<0) ; High Level


;***************************************************************************
;** VBAT - Battery Backup Module
;***************************************************************************/

; VBAT_CTRL masks
.equ VBAT_XOSCPWR_bm = 0x20 ; 32-kHz Crystal Oscillator High Power Mode bit mask
.equ VBAT_XOSCPWR_bp = 5 ; 32-kHz Crystal Oscillator High Power Mode bit position
.equ VBAT_HIGHESR_bm = 0x20 ; 32-kHz Crystal Oscillator High Power Mode bit mask
.equ VBAT_HIGHESR_bp = 5 ; 32-kHz Crystal Oscillator High Power Mode bit position
.equ VBAT_XOSCSEL_bm = 0x10 ; 32-kHz Crystal Oscillator Output Selection bit mask
.equ VBAT_XOSCSEL_bp = 4 ; 32-kHz Crystal Oscillator Output Selection bit position
.equ VBAT_XOSCEN_bm = 0x08 ; Crystal Oscillator Enable bit mask
.equ VBAT_XOSCEN_bp = 3 ; Crystal Oscillator Enable bit position
.equ VBAT_XOSCFDEN_bm = 0x04 ; Crystal Oscillator Failure Detection Monitor Enable bit mask
.equ VBAT_XOSCFDEN_bp = 2 ; Crystal Oscillator Failure Detection Monitor Enable bit position
.equ VBAT_ACCEN_bm = 0x02 ; Access Enable bit mask
.equ VBAT_ACCEN_bp = 1 ; Access Enable bit position
.equ VBAT_RESET_bm = 0x01 ; Reset bit mask
.equ VBAT_RESET_bp = 0 ; Reset bit position

; VBAT_STATUS masks
.equ VBAT_BBPWR_bm = 0x80 ; Battery backup Power bit mask
.equ VBAT_BBPWR_bp = 7 ; Battery backup Power bit position
.equ VBAT_XOSCRDY_bm = 0x08 ; Crystal Oscillator Ready bit mask
.equ VBAT_XOSCRDY_bp = 3 ; Crystal Oscillator Ready bit position
.equ VBAT_XOSCFAIL_bm = 0x04 ; Crystal Oscillator Failure bit mask
.equ VBAT_XOSCFAIL_bp = 2 ; Crystal Oscillator Failure bit position
.equ VBAT_BBBORF_bm = 0x02 ; Battery Backup Brown-Out Reset Flag bit mask
.equ VBAT_BBBORF_bp = 1 ; Battery Backup Brown-Out Reset Flag bit position
.equ VBAT_BBPORF_bm = 0x01 ; Battery Backup Power-On Reset Flag bit mask
.equ VBAT_BBPORF_bp = 0 ; Battery Backup Power-On Reset Flag bit position
 



; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30


; ***** DATA MEMORY DECLARATIONS *****************************************


#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x42000
#define PROGMEM_END (0x0000 + 0x42000 - 1)

#define APP_SECTION_START 0x0000
#define APP_SECTION_SIZE 0x40000
#define APP_SECTION_END (0x0000 + 0x40000 - 1)

#define APPTABLE_SECTION_START 0x3E000
#define APPTABLE_SECTION_SIZE 0x2000
#define APPTABLE_SECTION_END (0x3E000 + 0x2000 - 1)

#define BOOT_SECTION_START 0x40000
#define BOOT_SECTION_SIZE 0x2000
#define BOOT_SECTION_END (0x40000 + 0x2000 - 1)

#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x6000
#define DATAMEM_END (0x0000 + 0x6000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x1000
#define IO_END (0x0000 + 0x1000 - 1)

#define MAPPED_EEPROM_START 0x1000
#define MAPPED_EEPROM_SIZE 0x1000
#define MAPPED_EEPROM_END (0x1000 + 0x1000 - 1)

#define INTERNAL_SRAM_START 0x2000
#define INTERNAL_SRAM_SIZE 0x4000
#define INTERNAL_SRAM_END (0x2000 + 0x4000 - 1)

#define EEPROM_START 0x0000
#define EEPROM_SIZE 0x1000
#define EEPROM_END (0x0000 + 0x1000 - 1)

#define FUSE_START 0x0000
#define FUSE_SIZE 0x0006
#define FUSE_END (0x0000 + 0x0006 - 1)

#define LOCKBIT_START 0x0000
#define LOCKBIT_SIZE 0x0001
#define LOCKBIT_END (0x0000 + 0x0001 - 1)

#define SIGNATURES_START 0x0000
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x0000 + 0x0003 - 1)

#define USER_SIGNATURES_START 0x0000
#define USER_SIGNATURES_SIZE 0x0200
#define USER_SIGNATURES_END (0x0000 + 0x0200 - 1)

#define PROD_SIGNATURES_START 0x0000
#define PROD_SIGNATURES_SIZE 0x0034
#define PROD_SIGNATURES_END (0x0000 + 0x0034 - 1)


; Legacy definitions
.equ	FLASHEND    = (PROGMEM_END / 2)  ; Note: Word address
.equ	IOEND       = IO_END
.equ	SRAM_START	= INTERNAL_SRAM_START
.equ	SRAM_SIZE	= INTERNAL_SRAM_SIZE
.equ	RAMEND	    = INTERNAL_SRAM_END
.equ	E2END	    = EEPROM_END
.equ	EEPROMEND	= EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x42000
#pragma AVRPART MEMORY EEPROM 0x1000
#pragma AVRPART MEMORY INT_SRAM SIZE 0x4000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x2000



; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************

; OSC interrupt vectors
.equ OSC_XOSCF_vect = 2 ; External Oscillator Failure Interrupt (NMI)

; PORTC interrupt vectors
.equ PORTC_INT0_vect = 4 ; External Interrupt 0
.equ PORTC_INT1_vect = 6 ; External Interrupt 1

; PORTR interrupt vectors
.equ PORTR_INT0_vect = 8 ; External Interrupt 0
.equ PORTR_INT1_vect = 10 ; External Interrupt 1

; DMA interrupt vectors
.equ DMA_CH0_vect = 12 ; Channel 0 Interrupt
.equ DMA_CH1_vect = 14 ; Channel 1 Interrupt
.equ DMA_CH2_vect = 16 ; Channel 2 Interrupt
.equ DMA_CH3_vect = 18 ; Channel 3 Interrupt

; RTC32 interrupt vectors
.equ RTC32_OVF_vect = 20 ; Overflow Interrupt
.equ RTC32_COMP_vect = 22 ; Compare Interrupt

; TWIC interrupt vectors
.equ TWIC_TWIS_vect = 24 ; TWI Slave Interrupt
.equ TWIC_TWIM_vect = 26 ; TWI Master Interrupt

